Repository: Paulinhok/cubaj_cherestea
Catalog: lib/l10n/app_*.arb
Languages: es, fr, ro

source: Home
es: Inicio
fr: Accueil
ro: Acasă

# newCubingMenu
source: New Volume
es: Nuevo Volumen
fr: Nouveau cubage
ro: Cubaj Nou

# cubingListMenu
source: Volume Lists
es: Listas Volumen
fr: Listes de cubage
ro: Liste de Cubaj

# info
source: About
es: Acerca de
fr: À propos
ro: Info

# infoPageTitle
source: About Application
es: Información
fr: Infos cubage
ro: Despre Aplicație

# infoPage
source: Information Page
es: Página de Información
fr: Page d'informations
ro: Pagina de Informații

# infoContent
source: The Timber Volume Application is designed for calculating the volume in cubic meters of dimensioned working wood, such as boards, planks, beams, or squares.
es: La aplicación de cálculo de volumen de madera está destinada a calcular el volumen en metros cúbicos de madera dimensionada, como tablas, tablones, vigas o cuadrados.
fr: L'application de Cubage de Bois est destinée au calcul du volume en mètres cubes du bois d'œuvre dimensionné, tel que les planches, liteaux, madriers, chevrons ou poutres.
ro: Aplicația de Cubaj Cherestea este destinată calculării volumului în metri cubi a lemnului de lucru dimensionat, cum ar fi scândură, astereală, dulapi, căpriori sau pătrați.

# infoContent2
source: What is a cubic meter?
es: ¿Qué es el metro cúbico?
fr: Qu'est-ce qu'un mètre cube ?
ro: Ce este metrul cub?

# infoContent3
source: The cubic meter is one of
es: El metro cúbico es una de
fr: Le mètre cube est l'une des
ro: Metrul cub este una dintre

# infoContent4
source: the standardized units of measurement,
es: las unidades de medida estandarizadas,
fr: unités de mesure standardisées,
ro: unitățile de măsură standardizate,

# infoContent5
source: used in a variety of fields, but most often in the construction sector. The cubic meter, denoted in the International System (SI) as mc or m³, is a unit of volume measurement.
es: que se utiliza en una variedad de campos, pero más a menudo en el área de la construcción. El metro cúbico, denotado en el Sistema Internacional (SI) como mc o m³, es una unidad de medida de volumen.
fr: utilisée dans une variété de domaines, mais le plus souvent dans le secteur de la construction. Le mètre cube, noté dans le Système International (SI) mc ou m³, est une unité de mesure du volume.
ro: care se folosește într-o varietate de domenii, însă cel mai adesea în zona construcțiilor. Metrul cub, notat în Sistemul Internațional (SI) mc sau m³ este o unitate de măsură a volumului.

# infoContent6
source: How is the cubic meter calculated?
es: ¿Cómo se calcula el metro cúbico?
fr: Comment calcule-t-on un mètre cube ?
ro: Cum se calculează metrul cub?

# infoContent7
source: The cubic meter is calculated by considering the magnitude of three dimensions, namely length, width, and height. For better understanding, we can think of a box with a side of 1 meter, a cube, whose three dimensions we will multiply: length of 1 m, width of 1 m, and height also of 1 m. Thus, we will obtain a cubic meter, which represents the volume of the cube or box.
es: El metro cúbico se calcula teniendo en cuenta el orden de magnitud de tres dimensiones, a saber, longitud, ancho y altura. Para una mejor comprensión, podemos pensar en una caja con lados de 1 metro, un cubo, cuyas tres dimensiones multiplicaremos: longitud de 1 m, ancho de 1 m y altura también de 1 m. Así obtendremos un metro cúbico, que representa el volumen del cubo o de la caja.
fr: Le mètre cube est calculé en prenant en compte les dimensions de trois grandeurs, à savoir la longueur, la largeur et la hauteur. Pour mieux comprendre, on peut imaginer une boîte avec des côtés de 1 mètre, un cube, dont on multipliera les trois dimensions : longueur de 1 m, largeur de 1 m et hauteur de 1 m. On obtiendra ainsi un mètre cube, qui représente le volume du cube ou de la boîte.
ro: Metrul cub este calculat având în vedere ordinul de mărime a trei dimensiuni și anume lungime, lățime și înălțime. Pentru o mai bună înțelegere, putem să ne gândim la o cutie cu latura de 1 metru, un cub, căruia îi vom înmulți cele trei dimensiuni: lungime de 1 m, lățime de 1 m și înălțime tot de 1 m. Vom obține astfel un metru cub, care reprezintă volumul cubului sau al cutiei.

# infoContent8
source: Cubic meter formula
es: Fórmula del metro cúbico
fr: Formule du mètre cube
ro: Formula metrului cub

# infoContent9
source: To calculate 1 cubic meter of a material (using the volume calculation formula), it is necessary to know the exact, measured dimensions of the elements that constitute the volume. Thus, the general formula by which a cubic meter can be calculated is:
es: Para calcular 1 metro cúbico de un material (con la fórmula de cálculo de volumen) es necesario conocer las dimensiones exactas, medidas, de los elementos que constituyen el volumen. Así, la fórmula general para calcular un metro cúbico es:
fr: Pour calculer 1 mètre cube d'un matériau (avec la formule de calcul du cubage), il est nécessaire de connaître les dimensions exactes, mesurées, des éléments qui constituent le volume. Ainsi, la formule générale pour calculer un mètre cube est :
ro: Pentru a calcula 1 metru cub dintr-un material (cu formula de calcul pentru cubaj) este necesar să știi dimensiunile exacte, măsurate, ale elementelor care constituie volumul. Astfel, formula generală după care se poate calcula un metru cub este:

# infoContent10
source: Volume = Length (meters) x Width (meters) x Height (meters)
es: Volumen = Longitud (metros) x Ancho (metros) x Altura (metros)
fr: Volume = Longueur (mètres) x Largeur (mètres) x Hauteur (mètres)
ro: Volum = Lungime (metri) x Lățime (metri) x Înălțime (metri)

# infoContent11
source: The resulting value represents the volume in cubic meters, but it should be noted that not every time will we have clear, linear values to measure. In some situations, approximations (meter measurement units) may be needed because on some sides there may be obstacles that need to be considered. For example, if you want to calculate how many cubic meters are on a pallet of boards, here are the calculations you need to make:
es: El valor resultante representa el volumen en metros cúbicos, pero es importante tener en cuenta que no siempre tendremos valores claros y lineales para medir. En algunas situaciones puede ser necesario hacer aproximaciones (unidades de medida en metros) porque en algunos lados pueden aparecer obstáculos que deben considerarse. Por ejemplo, si deseas calcular cuántos metros cúbicos hay en un palé de tablas, aquí están los cálculos que debes hacer:
fr: La valeur obtenue représente le volume en mètres cubes, mais il est important de noter que nous n'aurons pas toujours des valeurs claires et linéaires à mesurer. Dans certaines situations, des approximations (unités de mesure en mètres) peuvent être nécessaires, car certaines faces peuvent présenter des obstacles qui doivent être pris en compte. Par exemple, si vous voulez calculer combien de mètres cubes se trouvent sur une palette de planches, voici les calculs à effectuer :
ro: Valoarea care rezultă reprezintă volumul în metri cubi, însă este de reținut faptul că nu de fiecare dată vom avea valori clare, liniare, pe care să le măsurăm. În unele situații poate fi nevoie de aproximări (unități de măsură metru) fiindcă pe unele dintre laturi pot apărea obstacole, care trebuie avute în vedere. De exemplu, dacă vrei să calculezi câți metri cubi sunt pe un palet cu scânduri, iată ce calcule trebuie să faci:

# infoContent12
source: Length = 4.5 m; Width = 0.9 m; Height = 0.8 m; Volume of the timber pallet = 4.5 m x 0.9 m x 0.8 m = 3.24 m³
es: Longitud = 4.5 m; Ancho = 0.9 m; Altura = 0.8 m; Volumen del palé de madera = 4.5 m x 0.9 m x 0.8 m = 3.24 m³
fr: Longueur = 4,5 m; Largeur = 0,9 m; Hauteur = 0,8 m; Volume de la palette de bois = 4,5 m x 0,9 m x 0,8 m = 3,24 m³
ro: Lungimea = 4.5 m; Lățimea = 0.9 m; Înălțimea = 0.8 m; Volumul paletului cu cherestea = 4.5 m x 0.9 m x 0.8 m = 3.24 m³

# appTitle
source: Timber Volume
es: Cubicaje de Madera
fr: Cubage de Bois
ro: Cubaj Cherestea

# newCubing
source: NEW VOLUME
es: Nuevo Volumen
fr: NOUVEAU CUBAGE
ro: CUBAJ NOU

# cubingList
source: VOLUME LISTS
es: Listas Volumen
fr: LISTES DE CUBAGE
ro: LISTE DE CUBAJ

# listOfCubbingTitle
source: List of Volume
es: Lista Volúmenes
fr: Liste de cubage
ro: Listă de Cubaj

# insertNameOfList
source: Insert name for volume list
es: Ingrese Nombre Lista
fr: Entrez le nom de la liste
ro: Introduceți numele listei de cubaj

source: Name of List
es: Nombre Lista
fr: Nom de la liste
ro: Numele Listei

source: CANCEL
es: Cancelar
fr: ANNULER
ro: RENUNȚĂ

source: SAVE
es: Guardar
fr: ENREGISTRER
ro: SALVEAZĂ

# nameListisEmpty
source: The list must have a name! Please enter a name!
es: ¡La lista debe tener un nombre! Por favor, ingrese un nombre.
fr: La liste doit avoir un nom ! Veuillez entrer un nom !
ro: Lista trebuie să aibă un nume! Introduceți un nume!

# listSnackBar
source: The list
es: La lista
fr: La liste
ro: Lista

# listAddedSuccessfully
source: has been successfully added to the database.
es: se ha añadido correctamente a la base de datos.
fr: a été ajoutée avec succès à la base de données.
ro: a fost adăugată cu succes în baza de date.

# listExist
source: already exists! Please enter another name.
es: ya existe! Por favor, ingrese otro nombre.
fr: existe déjà ! Veuillez entrer un autre nom.
ro: există deja! Introduceți alt nume.

# newCubingTitle
source: New Volume
es: Nuevo Volumen
fr: Nouveau cubage
ro: Cubaj Nou

source: Length:
es: Longitud:
fr: Longueur :
ro: Lungime:

source: meters
es: metros
fr: mètres
ro: metri

source: Width:
es: Ancho:
fr: Largeur :
ro: Lățime:

source: centimeters
es: centímetros
fr: centimètres
ro: centimetri

# calculateVolume
source: GET VOLUME
es: Calcular Volumen
fr: CALCULER VOLUME
ro: CUBEAZĂ

# errorMessage
source: Enter only numeric values
es: Solo Números
fr: Valeurs numériques uniquement
ro: Introdu doar valori numerice

source: Volume table
es: Tabla Volúmenes
fr: Tableau des volumes
ro: Tabel cubaj

source: Number:
es: Núm.:
fr: Numéro:
ro: Număr:

source: Result
es: Resultado
fr: Résultat
ro: Rezultat

# statsList
source: List Status
es: Estado de la Lista
fr: Statut de la liste
ro: Statusul Listei

source: Total volume
es: Volumen Total
fr: Volume total
ro: Cubaj total

source: View list
es: Ver Lista
fr: Voir la liste
ro: Vezi lista

source: Finish list
es: Finalizar Lista
fr: Terminer la liste
ro: Termină lista

# pretPerMeterTitle
source: Price per cubic meter³
es: Precio Por Metro
fr: Prix par m³
ro: Prețul pe metru³

# insertPricePerM
source: Enter price per cubic meter
es: Ingrese Precio Metro
fr: Entrez le prix par m³
ro: Introduceți prețul pe metru cub

# pricePerMeter
source: Price per meter³
es: Precio Metro
fr: Prix par m³
ro: Prețul pe m³

# validePrice
source: Enter a valid price!
es: Precio Inválido
fr: Prix valide !
ro: Introduceți un preț valid!

# resultOfCubingTitle
source: Round Wood Volume
es: Resultado Volumen
fr: Résultat du cubage
ro: Cubaj Lemn Rotund

source: LIST VOLUME:
es: Volumen:
fr: VOLUME :
ro: CUBAJUL LISTEI:

source: Unit Price
es: Precio Unitario
fr: Prix unitaire
ro: Pret Unitar

source: Total Price
es: Precio Total
fr: Prix total
ro: Pret Total

source: Detailed List
es: Lista Detallada
fr: Liste détaillée
ro: Listă Detaliată

source: Generate PDF
es: Generar PDF
fr: Générer PDF
ro: Generare PDF

source: Send Email
es: Enviar Correo
fr: Envoyer Email
ro: Trimite Email

# pdfGenerateSuccessfull
source: PDF was generated successfully!
es: PDF Generado
fr: PDF généré avec succès !
ro: PDF generat cu succes!

# openPdf
source: Open
es: Abrir PDF
fr: Ouvrir PDF
ro: Deschide

# listsCubingTitle
source: Volume Lists
es: Listas Volúmenes
fr: Listes de cubage
ro: Liste de Cubaj

# intNr
source: Nr.
es: Núm.
fr: Numéro

# nameList
source: List Name
es: Nombre Lista
fr: Nom de la liste
ro: Nume Lista

source: Volume
es: Volumen
ro: Cubaj Total

source: Date
es: Fecha
ro: Data

# cubajMasuratoriTitle
source: List:
es: Lista Medidas:
fr: Liste de mesures :
ro: Lista:

# buc
source: Pc.
es: Unid.
fr: Pièces
ro: Buc.

# lengthTable
source: Length
es: Longitud
fr: Longueur
ro: Lungime

# widthTable
source: Width
es: Ancho
fr: Largeur
ro: Latime

# cubingTable
source: Volume
es: Volumen
ro: Cubaj

# pricePerMeterMasuratori
source: Price per m³
es: Precio Metro
fr: Prix par m³

source: Pieces
es: Piezas
fr: Pièces
ro: Bucati

source: Delete List
es: Eliminar Lista
fr: Supprimer la liste
ro: Șterge Lista

# edit
source: Editing
es: Editar
fr: Modifier
ro: Editează

source: Update Price
es: Actualizar Precio
fr: Mettre à jour le prix
ro: Termină

# measuringAdd
source: Measurements added successfully!
es: Medición Añadida
fr: Ajouté avec succès !
ro: Masuratori adaugate cu succes!

# editPageTitle
source: Editing Volume
es: Editar Volumen
fr: Modifier
ro: Editează Cubaj

# numberEdit
source: Number
es: Núm.
fr: Numéro
ro: Număr

# piecesEdit
source: Pieces
es: Piezas
fr: Pièces
ro: Bucați

# thichnessEdit
source: Thickness
es: Espesor
fr: Épaisseur
ro: Grosime

# lengthEdit
source: Length
es: Longitud
fr: Longueur
ro: Lungime

# widthEdit
source: Width
es: Ancho
fr: Largeur
ro: Lățime

# editCubing
source: EDITING
es: Editar Volumen
fr: MODIFIER CUBAGE
ro: EDITEAZĂ

# cubing
source: Volume
es: Volumen
ro: Cubaj

# deleteCubing
source: DELETE VOLUME
es: Eliminar Volumen
fr: SUPPRIMER CUBAGE
ro: ȘTERGE CUBAJ

# valuesUnder0
source: Values ​​cannot be less than or equal to 0!
es: Valores Inválidos
fr: Valeurs supérieures à 0 uniquement !
ro: Valorile nu pot fi mai mici sau egale cu 0!

# diameterOver19
source: The diameter is too large for multiple pieces!
es: Diámetro Grande
fr: Diamètre trop grand !
ro: Diametrul este prea mare pentru mai multe bucăți!

# cubingAdd
source: The cube has been updated successfully!
es: Volumen Actualizado
fr: Cubage mis à jour !
ro: Cubajul a fost actualizat cu succes!

# cubingDelete
source: The cube was successfully deleted!
es: Volumen Eliminado
fr: Cubage supprimé !
ro: Cubajul a fost șters cu succes!

source: Thichness:
ro: Grosime:

# thichnessTable
source: Thickness
ro: Grosime
